# Practicing some of week 5 syntax

First for the first lab

In [1]:
#Dataframe manipulation library
import pandas as pd
#Math functions, we'll only need the sqrt function so let's import only that
from math import sqrt
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# Create a dictionary
D = {
        "A": 1.0,
        "B": [['x', 'y'], ['x', 'z'], ['x', 'z', 'y']],
        "C": np.array([3] * 3),
        "D": pd.Categorical(["test (2018)", "train (2019)", "test (2018)"]),
        "E": "foo",
    }

In [3]:
df = pd.DataFrame(D) 
df

     A          B  C             D    E
0  1.0     [x, y]  3   test (2018)  foo
1  1.0     [x, z]  3  train (2019)  foo
2  1.0  [x, z, y]  3   test (2018)  foo

In [4]:
newCol = df.D.str.extract('(\(\d\d\d\d\))', expand=False)
#newCol = df.D.str.extract('(\d)') <-- for example to get first digit, always 2
newCol

0    (2018)
1    (2019)
2    (2018)
Name: D, dtype: object

In [5]:
df['year'] = newCol
df

     A          B  C             D    E    year
0  1.0     [x, y]  3   test (2018)  foo  (2018)
1  1.0     [x, z]  3  train (2019)  foo  (2019)
2  1.0  [x, z, y]  3   test (2018)  foo  (2018)

In [6]:
df['year'] = df.year.str.extract('(\d\d\d\d)', expand=False)
df

     A          B  C             D    E  year
0  1.0     [x, y]  3   test (2018)  foo  2018
1  1.0     [x, z]  3  train (2019)  foo  2019
2  1.0  [x, z, y]  3   test (2018)  foo  2018

In [7]:
replacedCol = df.D.str.replace('(\(\d\d\d\d\))', 'HELLO')
replacedCol

0     test HELLO
1    train HELLO
2     test HELLO
Name: D, dtype: object

In [8]:
df['D'] = replacedCol
df

     A          B  C            D    E  year
0  1.0     [x, y]  3   test HELLO  foo  2018
1  1.0     [x, z]  3  train HELLO  foo  2019
2  1.0  [x, z, y]  3   test HELLO  foo  2018

In [9]:
df.at[0, 'New Col'] = 'Got it!' # adds new column, fills in value just at given row
df

     A          B  C            D    E  year  New Col
0  1.0     [x, y]  3   test HELLO  foo  2018  Got it!
1  1.0     [x, z]  3  train HELLO  foo  2019      NaN
2  1.0  [x, z, y]  3   test HELLO  foo  2018      NaN

In [10]:
# A way to loop through all rows of the data frame
for index, row in df.iterrows():
    print("Index:", index)
    print()
    print(row)
    print("***********")

Index: 0

A                   1
B              [x, y]
C                   3
D          test HELLO
E                 foo
year             2018
New Col       Got it!
Name: 0, dtype: object
***********
Index: 1

A                    1
B               [x, z]
C                    3
D          train HELLO
E                  foo
year              2019
New Col            NaN
Name: 1, dtype: object
***********
Index: 2

A                   1
B           [x, z, y]
C                   3
D          test HELLO
E                 foo
year             2018
New Col           NaN
Name: 2, dtype: object
***********

In [11]:
for index, row in df.iterrows():
    for ch in row['B']:
        df.at[index, ch] = "YES!" # adds new column 
        
df

     A          B  C            D    E  year  New Col     x     y     z
0  1.0     [x, y]  3   test HELLO  foo  2018  Got it!  YES!  YES!   NaN
1  1.0     [x, z]  3  train HELLO  foo  2019      NaN  YES!   NaN  YES!
2  1.0  [x, z, y]  3   test HELLO  foo  2018      NaN  YES!  YES!  YES!

In [12]:
newDF = df.fillna("NOPE!") # fill null values and RETURN it
df

     A          B  C            D    E  year  New Col     x     y     z
0  1.0     [x, y]  3   test HELLO  foo  2018  Got it!  YES!  YES!   NaN
1  1.0     [x, z]  3  train HELLO  foo  2019      NaN  YES!   NaN  YES!
2  1.0  [x, z, y]  3   test HELLO  foo  2018      NaN  YES!  YES!  YES!

In [13]:
# With values filled for null values.
# Shows "ONE HOT ENCODING TECHNIQUE" 
newDF

     A          B  C            D    E  year  New Col     x      y      z
0  1.0     [x, y]  3   test HELLO  foo  2018  Got it!  YES!   YES!  NOPE!
1  1.0     [x, z]  3  train HELLO  foo  2019    NOPE!  YES!  NOPE!   YES!
2  1.0  [x, z, y]  3   test HELLO  foo  2018    NOPE!  YES!   YES!   YES!

In [14]:
newDF.drop('z',1) # without 1 get error..?
newDF

     A          B  C            D    E  year  New Col     x      y      z
0  1.0     [x, y]  3   test HELLO  foo  2018  Got it!  YES!   YES!  NOPE!
1  1.0     [x, z]  3  train HELLO  foo  2019    NOPE!  YES!  NOPE!   YES!
2  1.0  [x, z, y]  3   test HELLO  foo  2018    NOPE!  YES!   YES!   YES!

In [15]:
newRows = [
            {'A': 'YES!', 'x':'5'},
            {'A':'Fun', 'year':2021, 'D': 'SPLIT'},
            {'A':'YES!', 'year':2021 }
         ] 
rowsAsDF = pd.DataFrame(newRows)
rowsAsDF

      A    x    year      D
0  YES!    5     NaN    NaN
1   Fun  NaN  2021.0  SPLIT
2  YES!  NaN  2021.0    NaN

In [16]:
aList = rowsAsDF['A'].tolist() # converts column to list object
aList

['YES!', 'Fun', 'YES!']

In [17]:
msk = df['y'].isin(aList)
msk

0     True
1    False
2     True
Name: y, dtype: bool

In [18]:
selectedRows  = df[msk] # get rows from list of booleans
selectedRows

     A          B  C           D    E  year  New Col     x     y     z
0  1.0     [x, y]  3  test HELLO  foo  2018  Got it!  YES!  YES!   NaN
2  1.0  [x, z, y]  3  test HELLO  foo  2018      NaN  YES!  YES!  YES!

In [19]:
rowsAsDF

      A    x    year      D
0  YES!    5     NaN    NaN
1   Fun  NaN  2021.0  SPLIT
2  YES!  NaN  2021.0    NaN

In [20]:
# TO BE CONTINUED ....